Documents/НачислениеВебМастерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеВебМастерам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НачисленияВебМастерам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчётыСВебМастерами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВебМастер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВебМастера</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кампания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РекламныеКампании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оффер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Офферы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лиды</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Депозиты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДепозитов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/НачисленияВебМастерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>НачисленияВебМастерам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВебМастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВебМастера</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кампания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеКампании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оффер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офферы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчётыСВебМастерами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчётыСВебМастерами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВебМастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВебМастера</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Конверсии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Конверсии</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Кампания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеКампании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Лиды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Депозиты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДепозитов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/УсловияВебМастеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УсловияВебМастеров</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВебМастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВебМастера</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оффер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офферы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МодельВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МоделиРасчёта</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/МоделиРасчёта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МоделиРасчёта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>CPA</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RevShare</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Гибрид</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/НачислениеВебМастерам/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УпрВалюта = Константы.УправленческаяВалюта.Получить();
	
	Движения.НачисленияВебМастерам.Записывать = Истина;
	Движения.ВзаиморасчётыСВебМастерами.Записывать = Истина;
	
	ИтогиПоВебМастерам = Новый Соответствие;
	Для Каждого СтрокаНачисления Из Начисления Цикл
		Движение = Движения.НачисленияВебМастерам.Добавить();
		Движение.Период = Дата;
		Движение.ВебМастер = СтрокаНачисления.ВебМастер;
		Движение.Кампания = СтрокаНачисления.Кампания;
		Движение.Оффер = СтрокаНачисления.Оффер;
		Движение.СуммаУпр = СтрокаНачисления.СуммаУпр;
		
		Итог = ИтогиПоВебМастерам[СтрокаНачисления.ВебМастер];
		Если Итог = Неопределено Тогда
			Итог = 0;
		КонецЕсли;
		ИтогиПоВебМастерам[СтрокаНачисления.ВебМастер] = Итог + СтрокаНачисления.СуммаУпр;
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из ИтогиПоВебМастерам Цикл
		Движение = Движения.ВзаиморасчётыСВебМастерами.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.ВебМастер = КлючИЗначение.Ключ;
		Движение.Валюта = УпрВалюта;
		Движение.Сумма = КлючИЗначение.Значение;
		Движение.СуммаУпр = КлючИЗначение.Значение;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоКонверсиям() Экспорт
	
	Начисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонверсииОбороты.Кампания КАК Кампания,
	|	КонверсииОбороты.Кампания.ВебМастер КАК ВебМастер,
	|	КонверсииОбороты.Кампания.Оффер КАК Оффер,
	|	СУММА(КонверсииОбороты.ЛидыОборот) КАК Лиды,
	|	СУММА(КонверсииОбороты.ДепозитыОборот) КАК Депозиты,
	|	СУММА(КонверсииОбороты.СуммаДепозитовОборот) КАК СуммаДепозитов
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.Конверсии.Обороты(&ДатаНачала, &ДатаОкончания, , Кампания.ВебМастер <> &ПустойВебМастер) КАК КонверсииОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	КонверсииОбороты.Кампания,
	|	КонверсииОбороты.Кампания.ВебМастер,
	|	КонверсииОбороты.Кампания.Оффер
	|;
	|
	|ВЫБРАТЬ
	|	Обороты.Кампания КАК Кампания,
	|	Обороты.ВебМастер КАК ВебМастер,
	|	Обороты.Оффер КАК Оффер,
	|	Обороты.Лиды КАК Лиды,
	|	Обороты.Депозиты КАК Депозиты,
	|	Обороты.СуммаДепозитов КАК СуммаДепозитов,
	|	ЕСТЬNULL(Условия.Ставка, 0) КАК Ставка,
	|	Условия.МодельВыплаты КАК МодельВыплаты,
	|	Курсы.Курс КАК Курс,
	|	Обороты.Оффер.Валюта КАК Валюта
	|ИЗ
	|	Обороты КАК Обороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияВебМастеров.СрезПоследних(&ДатаДокумента, ) КАК Условия
	|		ПО Условия.ВебМастер = Обороты.ВебМастер
	|			И Условия.Оффер = Обороты.Оффер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК Курсы
	|		ПО Курсы.Валюта = Обороты.Оффер.Валюта";
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("ПустойВебМастер", Справочники.ВебМастера.ПустаяСсылка());
	
	УпрВалюта = Константы.УправленческаяВалюта.Получить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ставка = 0 Или Выборка.МодельВыплаты = NULL Тогда
			Продолжить; // нет условий по паре веб-мастер + оффер
		КонецЕсли;
		Курс = Выборка.Курс;
		Если Выборка.Валюта = УпрВалюта Тогда
			Курс = 1;
		ИначеЕсли Курс = NULL Или Курс = 0 Тогда
			ВызватьИсключение СтрШаблон("Не задан курс валюты ""%1"" на дату %2. Заполните регистр сведений ""Курсы валют"".",
				Выборка.Валюта, Формат(Дата, "ДЛФ=D"));
		КонецЕсли;
		Сумма = 0;
		Если Выборка.МодельВыплаты = Перечисления.МоделиРасчёта.CPA
			Или Выборка.МодельВыплаты = Перечисления.МоделиРасчёта.Гибрид Тогда
			Сумма = Сумма + Выборка.Лиды * Выборка.Ставка;
		КонецЕсли;
		Если Выборка.МодельВыплаты = Перечисления.МоделиРасчёта.RevShare
			Или Выборка.МодельВыплаты = Перечисления.МоделиРасчёта.Гибрид Тогда
			Сумма = Сумма + Выборка.СуммаДепозитов * Выборка.Ставка / 100;
		КонецЕсли;
		НоваяСтрока = Начисления.Добавить();
		НоваяСтрока.ВебМастер = Выборка.ВебМастер;
		НоваяСтрока.Кампания = Выборка.Кампания;
		НоваяСтрока.Оффер = Выборка.Оффер;
		НоваяСтрока.Лиды = Выборка.Лиды;
		НоваяСтрока.Депозиты = Выборка.Депозиты;
		НоваяСтрока.СуммаДепозитов = Выборка.СуммаДепозитов;
		НоваяСтрока.Ставка = Выборка.Ставка;
		НоваяСтрока.СуммаУпр = Сумма * Курс;
	КонецЦикла;
	
КонецПроцедуры
